package day04;

public class Example1 {//class s
    public static void main(String[] args) { //main s

        /*
            [반복문]
                1. 조건에 따른 결과가 총족(true) 했을때 (반복)코드 실행
                2. 형태
                    for( 초기값 ; 조건문 ; 증감식 ){
                        실행문;
                    }
                    - 초기값 : 반복문에서 사용되는 변수 *주로 반복횟수                 , int i = 1;
                    - 조건문 : 반복변수의 조건문 *주로 반복횟수제한                   , i <=10;
                    - 증감식 : 반복변수의 증(가) 또는 감(소) 변화 식 *주로 반복횟수 증감, i++
                    - 실행문 : 조건 충족시 실행되는 코드/명령어;
                3. 실행순서
                    1) 초기값 -> 2)조건문 -> 3) 실행문 -> 4)증감식
                            -> 5)조건문 -> 6) 실행문 -> 7)증감식
                            ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
                            -> !) 조건이 false 이면 반복문 종료
                4. for 중첩가능 : 상위 for문이 1회전 마다 하위 for문의 전체 회전
                    for(){
                        for(){}
                    }
                5. 주요 키워드 :
                    1) break;       : 가장 가까운 반복문 {} 종료/탈출       vs return
                    2) continue;    : 가장 가까운 반복문(증감식) 이동

         */

    }//main e
}//class e
